In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
data = { 'Country': ['Belgium', 'India', 'Brazil'],
        'Captial': ['Brussels', 'New Delhi', 'Brasilia'],
        'Population': [11190846, 1303171035, 207847528]
}

## Series

In [3]:
s1 = pd.Series(data['Country'], index =['a','b','c'])

In [4]:
s1

a    Belgium
b      India
c     Brazil
dtype: object

In [5]:
s1.values

array(['Belgium', 'India', 'Brazil'], dtype=object)

返回的values是一个np array数据类型

In [6]:
s1.index

Index(['a', 'b', 'c'], dtype='object')

## DataFrame

In [7]:
df1 = DataFrame(data)

In [8]:
df1

     Captial  Country  Population
0   Brussels  Belgium    11190846
1  New Delhi    India  1303171035
2   Brasilia   Brazil   207847528

访问dataframe的行或列

In [9]:
cap = df1['Captial']

In [10]:
type(cap)

pandas.core.series.Series

上面的代码可以看出，取dataFrame的某一列，其实就是一个Series

可以粗略的理解： dataframe就是由多个Series组成的

### 访问某一行

`iterrows()`  返回一个生成器对象。Python中的generator可以通过for循环去取其中的数据

In [11]:
df1.iterrows()

In [12]:
for row in df1.iterrows():
    print (row),print (type(row)),print (len(row))
    print ("")
    print("**************************************")
    print(row[0])
    print("**************************************")
    print(row[1])
    print(type(row[1]))
    break

(0, Captial       Brussels
Country        Belgium
Population    11190846
Name: 0, dtype: object)
<class 'tuple'>
2

**************************************
0
**************************************
Captial       Brussels
Country        Belgium
Population    11190846
Name: 0, dtype: object
<class 'pandas.core.series.Series'>

可以看出每一行是一个元组，有两个元素: 元素一是一个整数，index。元素二是一个Series

### 既然dataframe行列都是Series，通过Series创建DataFrame

In [13]:
df1

     Captial  Country  Population
0   Brussels  Belgium    11190846
1  New Delhi    India  1303171035
2   Brasilia   Brazil   207847528

In [14]:
data

{'Captial': ['Brussels', 'New Delhi', 'Brasilia'],
 'Country': ['Belgium', 'India', 'Brazil'],
 'Population': [11190846, 1303171035, 207847528]}

In [15]:
s1 = pd.Series(data['Captial'])
s2 = pd.Series(data['Country'])
s3 = pd.Series(data['Population'])

传入一个list。list的元素是三个series

In [16]:
df_new = pd.DataFrame([s1,s2,s3],index =['Captial','Country','Population'] )

In [17]:
df_new

                   0           1          2
Captial     Brussels   New Delhi   Brasilia
Country      Belgium       India     Brazil
Population  11190846  1303171035  207847528

**但是我们发现行变列，列变成行了 因此我们需要转置一下**

In [18]:
df_new = df_new.T

In [19]:
df_new

     Captial  Country  Population
0   Brussels  Belgium    11190846
1  New Delhi    India  1303171035
2   Brasilia   Brazil   207847528

Series是一种以为的数据结构: 由index和values组成。
 
dataframe 是一种二维结构，由多个series组成。行标为index，列标为columns。